; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-8-8)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	p0-2 - location
	p0-3 - location
	p0-5 - location
	p0-6 - location
	p1-0 - location
	p1-4 - location
	p2-5 - location
	p3-1 - location
	p3-4 - location
	p5-8 - location
	p5-9 - location
	p6-1 - location
	p6-7 - location
	p6-8 - location
	p6-9 - location
	p7-1 - location
	p8-9 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s4)
	(at driver3 s9)
	(at driver4 s4)
	(at truck1 s3)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at truck4 s1)
	(empty truck4)
	(at truck5 s1)
	(empty truck5)
	(at truck6 s3)
	(empty truck6)
	(at truck7 s7)
	(empty truck7)
	(at truck8 s3)
	(empty truck8)
	(at package1 s2)
	(at package2 s4)
	(at package3 s4)
	(at package4 s4)
	(at package5 s2)
	(at package6 s4)
	(at package7 s0)
	(at package8 s5)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 20)
	(= (time-to-walk p0-2 s0) 20)
	(= (time-to-walk s2 p0-2) 18)
	(= (time-to-walk p0-2 s2) 18)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 45)
	(= (time-to-walk p0-3 s0) 45)
	(= (time-to-walk s3 p0-3) 77)
	(= (time-to-walk p0-3 s3) 77)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(= (time-to-walk s0 p0-5) 52)
	(= (time-to-walk p0-5 s0) 52)
	(= (time-to-walk s5 p0-5) 80)
	(= (time-to-walk p0-5 s5) 80)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(= (time-to-walk s0 p0-6) 94)
	(= (time-to-walk p0-6 s0) 94)
	(= (time-to-walk s6 p0-6) 77)
	(= (time-to-walk p0-6 s6) 77)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 14)
	(= (time-to-walk p1-0 s1) 14)
	(= (time-to-walk s0 p1-0) 8)
	(= (time-to-walk p1-0 s0) 8)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 25)
	(= (time-to-walk p1-4 s1) 25)
	(= (time-to-walk s4 p1-4) 90)
	(= (time-to-walk p1-4 s4) 90)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(= (time-to-walk s2 p2-5) 33)
	(= (time-to-walk p2-5 s2) 33)
	(= (time-to-walk s5 p2-5) 66)
	(= (time-to-walk p2-5 s5) 66)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(= (time-to-walk s3 p3-1) 5)
	(= (time-to-walk p3-1 s3) 5)
	(= (time-to-walk s1 p3-1) 63)
	(= (time-to-walk p3-1 s1) 63)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(= (time-to-walk s3 p3-4) 16)
	(= (time-to-walk p3-4 s3) 16)
	(= (time-to-walk s4 p3-4) 66)
	(= (time-to-walk p3-4 s4) 66)
	(path s5 p5-8)
	(path p5-8 s5)
	(path s8 p5-8)
	(path p5-8 s8)
	(= (time-to-walk s5 p5-8) 34)
	(= (time-to-walk p5-8 s5) 34)
	(= (time-to-walk s8 p5-8) 36)
	(= (time-to-walk p5-8 s8) 36)
	(path s5 p5-9)
	(path p5-9 s5)
	(path s9 p5-9)
	(path p5-9 s9)
	(= (time-to-walk s5 p5-9) 39)
	(= (time-to-walk p5-9 s5) 39)
	(= (time-to-walk s9 p5-9) 65)
	(= (time-to-walk p5-9 s9) 65)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(= (time-to-walk s6 p6-1) 84)
	(= (time-to-walk p6-1 s6) 84)
	(= (time-to-walk s1 p6-1) 23)
	(= (time-to-walk p6-1 s1) 23)
	(path s6 p6-7)
	(path p6-7 s6)
	(path s7 p6-7)
	(path p6-7 s7)
	(= (time-to-walk s6 p6-7) 59)
	(= (time-to-walk p6-7 s6) 59)
	(= (time-to-walk s7 p6-7) 84)
	(= (time-to-walk p6-7 s7) 84)
	(path s6 p6-8)
	(path p6-8 s6)
	(path s8 p6-8)
	(path p6-8 s8)
	(= (time-to-walk s6 p6-8) 25)
	(= (time-to-walk p6-8 s6) 25)
	(= (time-to-walk s8 p6-8) 57)
	(= (time-to-walk p6-8 s8) 57)
	(path s6 p6-9)
	(path p6-9 s6)
	(path s9 p6-9)
	(path p6-9 s9)
	(= (time-to-walk s6 p6-9) 37)
	(= (time-to-walk p6-9 s6) 37)
	(= (time-to-walk s9 p6-9) 65)
	(= (time-to-walk p6-9 s9) 65)
	(path s7 p7-1)
	(path p7-1 s7)
	(path s1 p7-1)
	(path p7-1 s1)
	(= (time-to-walk s7 p7-1) 15)
	(= (time-to-walk p7-1 s7) 15)
	(= (time-to-walk s1 p7-1) 56)
	(= (time-to-walk p7-1 s1) 56)
	(path s8 p8-9)
	(path p8-9 s8)
	(path s9 p8-9)
	(path p8-9 s9)
	(= (time-to-walk s8 p8-9) 83)
	(= (time-to-walk p8-9 s8) 83)
	(= (time-to-walk s9 p8-9) 59)
	(= (time-to-walk p8-9 s9) 59)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 33)
	(= (time-to-drive s3 s0) 33)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 34)
	(= (time-to-drive s4 s0) 34)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 39)
	(= (time-to-drive s7 s0) 39)
	(link s0 s9)
	(link s9 s0)
	(= (time-to-drive s0 s9) 27)
	(= (time-to-drive s9 s0) 27)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 11)
	(= (time-to-drive s6 s1) 11)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 52)
	(= (time-to-drive s7 s1) 52)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 35)
	(= (time-to-drive s0 s2) 35)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 36)
	(= (time-to-drive s5 s2) 36)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 42)
	(= (time-to-drive s6 s2) 42)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 67)
	(= (time-to-drive s1 s4) 67)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 1)
	(= (time-to-drive s3 s4) 1)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 46)
	(= (time-to-drive s5 s4) 46)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 29)
	(= (time-to-drive s6 s4) 29)
	(link s4 s9)
	(link s9 s4)
	(= (time-to-drive s4 s9) 17)
	(= (time-to-drive s9 s4) 17)
	(link s5 s8)
	(link s8 s5)
	(= (time-to-drive s5 s8) 12)
	(= (time-to-drive s8 s5) 12)
	(link s5 s9)
	(link s9 s5)
	(= (time-to-drive s5 s9) 63)
	(= (time-to-drive s9 s5) 63)
	(link s6 s9)
	(link s9 s6)
	(= (time-to-drive s6 s9) 53)
	(= (time-to-drive s9 s6) 53)
	(link s7 s2)
	(link s2 s7)
	(= (time-to-drive s7 s2) 50)
	(= (time-to-drive s2 s7) 50)
	(link s7 s3)
	(link s3 s7)
	(= (time-to-drive s7 s3) 28)
	(= (time-to-drive s3 s7) 28)
	(link s7 s6)
	(link s6 s7)
	(= (time-to-drive s7 s6) 36)
	(= (time-to-drive s6 s7) 36)
	(link s8 s6)
	(link s6 s8)
	(= (time-to-drive s8 s6) 72)
	(= (time-to-drive s6 s8) 72)
	(link s8 s7)
	(link s7 s8)
	(= (time-to-drive s8 s7) 86)
	(= (time-to-drive s7 s8) 86)
	(link s9 s1)
	(link s1 s9)
	(= (time-to-drive s9 s1) 19)
	(= (time-to-drive s1 s9) 19)
	(link s9 s3)
	(link s3 s9)
	(= (time-to-drive s9 s3) 96)
	(= (time-to-drive s3 s9) 96)
	(link s9 s7)
	(link s7 s9)
	(= (time-to-drive s9 s7) 43)
	(= (time-to-drive s7 s9) 43)
	(link s9 s8)
	(link s8 s9)
	(= (time-to-drive s9 s8) 56)
	(= (time-to-drive s8 s9) 56)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s8)
	(at driver2 s6)
	(at driver4 s1)
	(at truck2 s4)
	(at truck4 s6)
	(at truck5 s0)
	(at truck6 s6)
	(at truck7 s8)
	(at package1 s3)
	(at package2 s7)
	(at package3 s1)
	(at package4 s6)
	(at package5 s7)
	(at package6 s8)
	(at package7 s0)
	(at package8 s4)
	))

(:metric minimize (+ (+ (* 3  (total-time)) (* 3  (driven))) (* 1  (walked))))

)

; plan
1. (load-truck package2 truck2 s4)
   deleted: (at package2 s4)
   added: (in package2 truck2)
   goals met: 2 of 16
2. (load-truck package3 truck2 s4)
   deleted: (at package3 s4)
   added: (in package3 truck2)
   goals met: 2 of 16
3. (load-truck package4 truck2 s4)
   deleted: (at package4 s4)
   added: (in package4 truck2)
   goals met: 2 of 16
4. (walk driver1 s2 p0-2)
   deleted: (at driver1 s2)
   added: (at driver1 p0-2)
   changed: (walked) from 0 to 18
   goals met: 2 of 16
5. (board-truck driver2 truck2 s4)
   deleted: (at driver2 s4) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 2 of 16
6. (drive-truck truck2 s4 s1 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   changed: (driven) from 0 to 67
   goals met: 1 of 16
7. (walk driver4 s4 p3-4)
   deleted: (at driver4 s4)
   added: (at driver4 p3-4)
   changed: (walked) from 18 to 84
   goals met: 1 of 16
8. (unload-truck package3 truck2 s1)
   deleted: (in package3 truck2)
   added: (at package3 s1)
   goals met: 2 of 16
9. (drive-truck truck2 s1 s4 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   changed: (driven) from 67 to 134
   goals met: 3 of 16
10. (load-truck package6 truck2 s4)
   deleted: (at package6 s4)
   added: (in package6 truck2)
   goals met: 3 of 16
11. (drive-truck truck2 s4 s6 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s6)
   changed: (driven) from 134 to 163
   goals met: 2 of 16
12. (walk driver1 p0-2 s2)
   deleted: (at driver1 p0-2)
   added: (at driver1 s2)
   changed: (walked) from 84 to 102
   goals met: 2 of 16
13. (walk driver4 p3-4 s3)
   deleted: (at driver4 p3-4)
   added: (at driver4 s3)
   changed: (walked) from 102 to 118
   goals met: 2 of 16
14. (unload-truck package4 truck2 s6)
   deleted: (in package4 truck2)
   added: (at package4 s6)
   goals met: 3 of 16
15. (walk driver4 s3 p3-1)
   deleted: (at driver4 s3)
   added: (at driver4 p3-1)
   changed: (walked) from 118 to 123
   goals met: 3 of 16
16. (drive-truck truck2 s6 s8 driver2)
   deleted: (at truck2 s6)
   added: (at truck2 s8)
   changed: (driven) from 163 to 235
   goals met: 3 of 16
17. (unload-truck package6 truck2 s8)
   deleted: (in package6 truck2)
   added: (at package6 s8)
   goals met: 4 of 16
18. (walk driver1 s2 p2-5)
   deleted: (at driver1 s2)
   added: (at driver1 p2-5)
   changed: (walked) from 123 to 156
   goals met: 4 of 16
19. (walk driver1 p2-5 s5)
   deleted: (at driver1 p2-5)
   added: (at driver1 s5)
   changed: (walked) from 156 to 222
   goals met: 4 of 16
20. (walk driver1 s5 p5-8)
   deleted: (at driver1 s5)
   added: (at driver1 p5-8)
   changed: (walked) from 222 to 256
   goals met: 4 of 16
21. (walk driver1 p5-8 s8)
   deleted: (at driver1 p5-8)
   added: (at driver1 s8)
   changed: (walked) from 256 to 292
   goals met: 5 of 16
22. (drive-truck truck2 s8 s5 driver2)
   deleted: (at truck2 s8)
   added: (at truck2 s5)
   changed: (driven) from 235 to 247
   goals met: 5 of 16
23. (drive-truck truck2 s5 s2 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s2)
   changed: (driven) from 247 to 283
   goals met: 5 of 16
24. (load-truck package1 truck2 s2)
   deleted: (at package1 s2)
   added: (in package1 truck2)
   goals met: 5 of 16
25. (load-truck package5 truck2 s2)
   deleted: (at package5 s2)
   added: (in package5 truck2)
   goals met: 5 of 16
26. (drive-truck truck2 s2 s5 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s5)
   changed: (driven) from 283 to 319
   goals met: 5 of 16
27. (load-truck package8 truck2 s5)
   deleted: (at package8 s5)
   added: (in package8 truck2)
   goals met: 5 of 16
28. (drive-truck truck2 s5 s2 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s2)
   changed: (driven) from 319 to 355
   goals met: 5 of 16
29. (drive-truck truck2 s2 s6 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s6)
   changed: (driven) from 355 to 397
   goals met: 5 of 16
30. (drive-truck truck2 s6 s1 driver2)
   deleted: (at truck2 s6)
   added: (at truck2 s1)
   changed: (driven) from 397 to 408
   goals met: 5 of 16
31. (walk driver4 p3-1 s3)
   deleted: (at driver4 p3-1)
   added: (at driver4 s3)
   changed: (walked) from 292 to 297
   goals met: 5 of 16
32. (board-truck driver4 truck6 s3)
   deleted: (at driver4 s3) (empty truck6)
   added: (driving driver4 truck6)
   goals met: 5 of 16
33. (drive-truck truck6 s3 s9 driver4)
   deleted: (at truck6 s3)
   added: (at truck6 s9)
   changed: (driven) from 408 to 504
   goals met: 5 of 16
34. (drive-truck truck6 s9 s1 driver4)
   deleted: (at truck6 s9)
   added: (at truck6 s1)
   changed: (driven) from 504 to 523
   goals met: 5 of 16
35. (disembark-truck driver4 truck6 s1)
   deleted: (driving driver4 truck6)
   added: (at driver4 s1) (empty truck6)
   goals met: 6 of 16
36. (drive-truck truck2 s1 s7 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s7)
   changed: (driven) from 523 to 575
   goals met: 6 of 16
37. (unload-truck package5 truck2 s7)
   deleted: (in package5 truck2)
   added: (at package5 s7)
   goals met: 7 of 16
38. (unload-truck package2 truck2 s7)
   deleted: (in package2 truck2)
   added: (at package2 s7)
   goals met: 8 of 16
39. (board-truck driver4 truck5 s1)
   deleted: (at driver4 s1) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 7 of 16
40. (drive-truck truck5 s1 s9 driver4)
   deleted: (at truck5 s1)
   added: (at truck5 s9)
   changed: (driven) from 575 to 594
   goals met: 7 of 16
41. (drive-truck truck2 s7 s3 driver2)
   deleted: (at truck2 s7)
   added: (at truck2 s3)
   changed: (driven) from 594 to 622
   goals met: 7 of 16
42. (drive-truck truck5 s9 s7 driver4)
   deleted: (at truck5 s9)
   added: (at truck5 s7)
   changed: (driven) from 622 to 665
   goals met: 7 of 16
43. (disembark-truck driver4 truck5 s7)
   deleted: (driving driver4 truck5)
   added: (at driver4 s7) (empty truck5)
   goals met: 7 of 16
44. (unload-truck package1 truck2 s3)
   deleted: (in package1 truck2)
   added: (at package1 s3)
   goals met: 8 of 16
45. (drive-truck truck2 s3 s4 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   changed: (driven) from 665 to 666
   goals met: 9 of 16
46. (unload-truck package8 truck2 s4)
   deleted: (in package8 truck2)
   added: (at package8 s4)
   goals met: 10 of 16
47. (walk driver4 s7 p7-1)
   deleted: (at driver4 s7)
   added: (at driver4 p7-1)
   changed: (walked) from 297 to 312
   goals met: 10 of 16
48. (walk driver4 p7-1 s1)
   deleted: (at driver4 p7-1)
   added: (at driver4 s1)
   changed: (walked) from 312 to 368
   goals met: 11 of 16
49. (board-truck driver4 truck4 s1)
   deleted: (at driver4 s1) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 10 of 16
50. (drive-truck truck4 s1 s7 driver4)
   deleted: (at truck4 s1)
   added: (at truck4 s7)
   changed: (driven) from 666 to 718
   goals met: 10 of 16
51. (disembark-truck driver4 truck4 s7)
   deleted: (driving driver4 truck4)
   added: (at driver4 s7) (empty truck4)
   goals met: 10 of 16
52. (walk driver4 s7 p7-1)
   deleted: (at driver4 s7)
   added: (at driver4 p7-1)
   changed: (walked) from 368 to 383
   goals met: 10 of 16
53. (drive-truck truck2 s4 s6 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s6)
   changed: (driven) from 718 to 747
   goals met: 9 of 16
54. (walk driver4 p7-1 s1)
   deleted: (at driver4 p7-1)
   added: (at driver4 s1)
   changed: (walked) from 383 to 439
   goals met: 10 of 16
55. (disembark-truck driver2 truck2 s6)
   deleted: (driving driver2 truck2)
   added: (at driver2 s6) (empty truck2)
   goals met: 11 of 16
56. (walk driver2 s6 p6-7)
   deleted: (at driver2 s6)
   added: (at driver2 p6-7)
   changed: (walked) from 439 to 498
   goals met: 10 of 16
57. (walk driver2 p6-7 s7)
   deleted: (at driver2 p6-7)
   added: (at driver2 s7)
   changed: (walked) from 498 to 582
   goals met: 10 of 16
58. (board-truck driver2 truck4 s7)
   deleted: (at driver2 s7) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 10 of 16
59. (drive-truck truck4 s7 s6 driver2)
   deleted: (at truck4 s7)
   added: (at truck4 s6)
   changed: (driven) from 747 to 783
   goals met: 11 of 16
60. (disembark-truck driver2 truck4 s6)
   deleted: (driving driver2 truck4)
   added: (at driver2 s6) (empty truck4)
   goals met: 12 of 16
61. (board-truck driver4 truck6 s1)
   deleted: (at driver4 s1) (empty truck6)
   added: (driving driver4 truck6)
   goals met: 11 of 16
62. (drive-truck truck6 s1 s6 driver4)
   deleted: (at truck6 s1)
   added: (at truck6 s6)
   changed: (driven) from 783 to 794
   goals met: 12 of 16
63. (walk driver2 s6 p6-7)
   deleted: (at driver2 s6)
   added: (at driver2 p6-7)
   changed: (walked) from 582 to 641
   goals met: 11 of 16
64. (walk driver2 p6-7 s7)
   deleted: (at driver2 p6-7)
   added: (at driver2 s7)
   changed: (walked) from 641 to 725
   goals met: 11 of 16
65. (disembark-truck driver4 truck6 s6)
   deleted: (driving driver4 truck6)
   added: (at driver4 s6) (empty truck6)
   goals met: 11 of 16
66. (board-truck driver4 truck2 s6)
   deleted: (at driver4 s6) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 11 of 16
67. (drive-truck truck2 s6 s1 driver4)
   deleted: (at truck2 s6)
   added: (at truck2 s1)
   changed: (driven) from 794 to 805
   goals met: 11 of 16
68. (disembark-truck driver4 truck2 s1)
   deleted: (driving driver4 truck2)
   added: (at driver4 s1) (empty truck2)
   goals met: 12 of 16
69. (board-truck driver2 truck7 s7)
   deleted: (at driver2 s7) (empty truck7)
   added: (driving driver2 truck7)
   goals met: 12 of 16
70. (drive-truck truck7 s7 s8 driver2)
   deleted: (at truck7 s7)
   added: (at truck7 s8)
   changed: (driven) from 805 to 891
   goals met: 13 of 16
71. (walk driver4 s1 p7-1)
   deleted: (at driver4 s1)
   added: (at driver4 p7-1)
   changed: (walked) from 725 to 781
   goals met: 12 of 16
72. (walk driver4 p7-1 s7)
   deleted: (at driver4 p7-1)
   added: (at driver4 s7)
   changed: (walked) from 781 to 796
   goals met: 12 of 16
73. (board-truck driver4 truck5 s7)
   deleted: (at driver4 s7) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 12 of 16
74. (drive-truck truck5 s7 s0 driver4)
   deleted: (at truck5 s7)
   added: (at truck5 s0)
   changed: (driven) from 891 to 930
   goals met: 13 of 16
75. (disembark-truck driver4 truck5 s0)
   deleted: (driving driver4 truck5)
   added: (at driver4 s0) (empty truck5)
   goals met: 13 of 16
76. (drive-truck truck7 s8 s6 driver2)
   deleted: (at truck7 s8)
   added: (at truck7 s6)
   changed: (driven) from 930 to 1002
   goals met: 12 of 16
77. (disembark-truck driver2 truck7 s6)
   deleted: (driving driver2 truck7)
   added: (at driver2 s6) (empty truck7)
   goals met: 13 of 16
78. (walk driver2 s6 p6-1)
   deleted: (at driver2 s6)
   added: (at driver2 p6-1)
   changed: (walked) from 796 to 880
   goals met: 12 of 16
79. (walk driver4 s0 p1-0)
   deleted: (at driver4 s0)
   added: (at driver4 p1-0)
   changed: (walked) from 880 to 888
   goals met: 12 of 16
80. (walk driver2 p6-1 s1)
   deleted: (at driver2 p6-1)
   added: (at driver2 s1)
   changed: (walked) from 888 to 911
   goals met: 12 of 16
81. (board-truck driver2 truck2 s1)
   deleted: (at driver2 s1) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 12 of 16
82. (walk driver4 p1-0 s1)
   deleted: (at driver4 p1-0)
   added: (at driver4 s1)
   changed: (walked) from 911 to 925
   goals met: 13 of 16
83. (drive-truck truck2 s1 s4 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   changed: (driven) from 1002 to 1069
   goals met: 14 of 16
84. (walk driver1 s8 p6-8)
   deleted: (at driver1 s8)
   added: (at driver1 p6-8)
   changed: (walked) from 925 to 982
   goals met: 13 of 16
85. (drive-truck truck2 s4 s6 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s6)
   changed: (driven) from 1069 to 1098
   goals met: 12 of 16
86. (disembark-truck driver2 truck2 s6)
   deleted: (driving driver2 truck2)
   added: (at driver2 s6) (empty truck2)
   goals met: 13 of 16
87. (board-truck driver2 truck7 s6)
   deleted: (at driver2 s6) (empty truck7)
   added: (driving driver2 truck7)
   goals met: 12 of 16
88. (walk driver1 p6-8 s6)
   deleted: (at driver1 p6-8)
   added: (at driver1 s6)
   changed: (walked) from 982 to 1007
   goals met: 12 of 16
89. (board-truck driver1 truck2 s6)
   deleted: (at driver1 s6) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 12 of 16
90. (drive-truck truck2 s6 s4 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s4)
   changed: (driven) from 1098 to 1127
   goals met: 13 of 16
91. (drive-truck truck7 s6 s4 driver2)
   deleted: (at truck7 s6)
   added: (at truck7 s4)
   changed: (driven) from 1127 to 1156
   goals met: 13 of 16
92. (drive-truck truck2 s4 s9 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s9)
   changed: (driven) from 1156 to 1173
   goals met: 12 of 16
93. (drive-truck truck7 s4 s9 driver2)
   deleted: (at truck7 s4)
   added: (at truck7 s9)
   changed: (driven) from 1173 to 1190
   goals met: 12 of 16
94. (drive-truck truck2 s9 s4 driver1)
   deleted: (at truck2 s9)
   added: (at truck2 s4)
   changed: (driven) from 1190 to 1207
   goals met: 13 of 16
95. (disembark-truck driver2 truck7 s9)
   deleted: (driving driver2 truck7)
   added: (at driver2 s9) (empty truck7)
   goals met: 13 of 16
96. (walk driver2 s9 p6-9)
   deleted: (at driver2 s9)
   added: (at driver2 p6-9)
   changed: (walked) from 1007 to 1072
   goals met: 13 of 16
97. (walk driver2 p6-9 s6)
   deleted: (at driver2 p6-9)
   added: (at driver2 s6)
   changed: (walked) from 1072 to 1109
   goals met: 14 of 16
98. (board-truck driver3 truck7 s9)
   deleted: (at driver3 s9) (empty truck7)
   added: (driving driver3 truck7)
   goals met: 14 of 16
99. (drive-truck truck7 s9 s8 driver3)
   deleted: (at truck7 s9)
   added: (at truck7 s8)
   changed: (driven) from 1207 to 1263
   goals met: 15 of 16
100. (drive-truck truck2 s4 s9 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s9)
   changed: (driven) from 1263 to 1280
   goals met: 14 of 16
101. (drive-truck truck2 s9 s8 driver1)
   deleted: (at truck2 s9)
   added: (at truck2 s8)
   changed: (driven) from 1280 to 1336
   goals met: 14 of 16
102. (disembark-truck driver1 truck2 s8)
   deleted: (driving driver1 truck2)
   added: (at driver1 s8) (empty truck2)
   goals met: 15 of 16
103. (disembark-truck driver3 truck7 s8)
   deleted: (driving driver3 truck7)
   added: (at driver3 s8) (empty truck7)
   goals met: 15 of 16
104. (board-truck driver3 truck2 s8)
   deleted: (at driver3 s8) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 15 of 16
105. (drive-truck truck2 s8 s9 driver3)
   deleted: (at truck2 s8)
   added: (at truck2 s9)
   changed: (driven) from 1336 to 1392
   goals met: 15 of 16
106. (drive-truck truck2 s9 s4 driver3)
   deleted: (at truck2 s9)
   added: (at truck2 s4)
   changed: (driven) from 1392 to 1409
   goals met: 16 of 16
